## Import Heroku PostgreSQL database into Pandas.
### proj2-team02: TeamMovies
### Project #2
### September 2020

In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import numpy as np

plt.rcParams['figure.figsize'] = (14.0, 8.0)

# Reflect Tables into SQLAlchemy ORM

In [2]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func, inspect, MetaData, Table, select

# Initialize the Base object using the automap_base in order to refelect the database.
from sqlalchemy.ext.automap import automap_base
Base = automap_base()
metadata = MetaData()

### Testing the Heroku Postgres

In [3]:
# Create an engine that can talk to the database
DATABASE_URL = 'postgres://zttrfwwdkbvjri:993e860c0b322e56c742c10a0edd25113b9ed456845f9c82571ae166641b32f3@ec2-100-25-100-81.compute-1.amazonaws.com:5432/d90qpidcl4m7ls'
engine = sqlalchemy.create_engine(DATABASE_URL)

## Explore Database

In [4]:
# Use the Inspector to explore the Herohu database and print the table names
inspector = inspect(engine)
inspector.get_table_names()

['country_origin',
 'movie_country_junction',
 'production_company',
 'movie',
 'genre',
 'movie_genre_junction',
 'language',
 'movie_language_junction',
 'job_title',
 'movie_person_title_junction',
 'person']

In [5]:
# Print the names of tables in the Heroku PostgreSQL database:
print(engine.table_names())

['country_origin', 'movie_country_junction', 'production_company', 'movie', 'genre', 'movie_genre_junction', 'language', 'movie_language_junction', 'job_title', 'movie_person_title_junction', 'person']

In [6]:
# Use Inspector to print the column names and types for the movie table.
columns = inspector.get_columns('movie')
for col in columns:
    print(col['name'], col["type"])

movie_id VARCHAR(100)
movie_title TEXT
year_published INTEGER
movie_duration INTEGER
description TEXT
votes_avg DOUBLE PRECISION
votes_count INTEGER
budget VARCHAR(50)
usa_gross_income VARCHAR(50)
worlwide_gross_income VARCHAR(50)
company_id VARCHAR(100)

In [7]:
# Use Inspector to print the column names and types for the movie_genre_junction table.
columns = inspector.get_columns('movie_genre_junction')
for col in columns:
    print(col['name'], col["type"])

movie_id VARCHAR(100)
genre_id VARCHAR(100)

In [8]:
# Use Inspector to print the column names and types for the genre table.
columns = inspector.get_columns('genre')
for col in columns:
    print(col['name'], col["type"])

genre_id VARCHAR(100)
genre_name VARCHAR(255)

## Refection of Heroku database

In [9]:
# Use the prepare method on the Base object create a refection of the entire database.
Base.prepare(engine, reflect=True)

In [10]:
#The relection created ORM objects of tables in the database, and accessible under the class property of the automap Base.
Base.classes.keys()

['country_origin',
 'movie_country_junction',
 'production_company',
 'movie',
 'genre',
 'language',
 'job_title',
 'movie_person_title_junction',
 'person']

In [11]:
# Let's create reference to the ORM objects.
Country_origin = Base.classes.country_origin
Movie_country_junction = Base.classes.movie_country_junction
Production_company = Base.classes.production_company
Movie = Base.classes.movie
Genre = Base.classes.genre
Language = Base.classes.language
Job_title = Base.classes.job_title
movie_person_title_junction = Base.classes.movie_person_title_junction
Person = Base.classes.person

In [12]:
# Create our session link for Python to interact with the database.
session = Session(engine)

In [13]:
# Let's create a function that will take a ORM query statement and create a Pandas DataFrame!
def query_to_dataframe(query_stmt, my_database = engine):
    query_df = pd.read_sql_query(query_stmt, my_database)
    return query_df

### Let's reflect the movie_genre_junction table separately

In [27]:
metadata.reflect(bind=engine)

In [28]:
metadata.tables.keys()

dict_keys(['country_origin', 'movie_country_junction', 'production_company', 'movie', 'genre', 'movie_genre_junction', 'language', 'movie_language_junction', 'job_title', 'movie_person_title_junction', 'person'])

In [29]:
# Let's reflect the movie_genre_junction table separately, since it didn't get refected in during the automap Base
Movie_genre_junction = Table("movie_genre_junction", metadata, autoload=True, autoload_with=engine)

In [34]:
Movie_genre_junction.foreign_keys

{ForeignKey('genre.genre_id'), ForeignKey('movie.movie_id')}

In [45]:
# Create the Movie_genre_junction DataFrame
mov_gen_query_stmt = session.query(Movie_genre_junction).statement
mov_gen_df = pd.read_sql_query(mov_gen_query_stmt, session.bind)
mov_gen_df  #.head()

         movie_id genre_id
0       tt0000574        0
1       tt0000574        1
2       tt0000574        2
3       tt0001892        2
4       tt0002101        2
...           ...      ...
166216  tt9905412        2
166217  tt9905462        2
166218  tt9911774        2
166219  tt9914286        2
166220  tt9914286       12

[166221 rows x 2 columns]

In [51]:
# Create the Genre DataFrame
genre_query_stmt = session.query(Genre).statement
genre_df = pd.read_sql_query(genre_query_stmt, session.bind)
genre_df.head()

  genre_id genre_name
0        0  Biography
1        1      Crime
2        2      Drama
3        3    History
4        4  Adventure

In [65]:
# Merge Movie_genre_junction and Genre DataFrames
# Merge the two data sets along genre_id
mov_gen_merge_df = pd.merge(mov_gen_df, genre_df, how="left", on=["genre_id", "genre_id"], suffixes=('_m', '_g'))
mov_gen_merge_df #.head()

         movie_id genre_id genre_name
0       tt0000574        0  Biography
1       tt0000574        1      Crime
2       tt0000574        2      Drama
3       tt0001892        2      Drama
4       tt0002101        2      Drama
...           ...      ...        ...
166216  tt9905412        2      Drama
166217  tt9905462        2      Drama
166218  tt9911774        2      Drama
166219  tt9914286        2      Drama
166220  tt9914286       12     Family

[166221 rows x 3 columns]

In [61]:
 current_movie_info = session.query(Movie.movie_id,Movie.movie_title, Movie.year_published,\
                               Movie.movie_duration, Movie.budget, Movie.usa_gross_income,\
                               Movie.worlwide_gross_income,\
                               Country_origin.country_name, Country_origin.lat, Country_origin.long, Movie.votes_avg,\
                               #Genre.genre_name,\
                               Production_company.company_name).filter(\
                               Movie.movie_id == Movie_country_junction.movie_id).filter(\
                               Movie.company_id == Production_company.company_id).filter(\
                               #Movie.movie_id == Movie_genre_junction.movie_id).filter(\
                               #Movie_genre_junction.genre_id == Genre.genre_id).filter(\
                               Movie_country_junction.country_id == Country_origin.country_id).statement
current_movie_info_df = pd.read_sql_query(current_movie_info, session.bind)
current_movie_info_df #.head()

,movie_id,movie_title,year_published,movie_duration,budget,usa_gross_income,worlwide_gross_income,country_name,lat,long,votes_avg,company_name
0,tt0000574,The Story of the Kelly Gang,1906,70,$ 2250,None,None,Australia,-25.274398,133.775136,6.1,J. and N. Tait
1,tt0001892,Den sorte drøm,1911,53,None,None,None,Germany,51.165691,10.451526,5.9,Fotorama
2,tt0001892,Den sorte drøm,1911,53,None,None,None,Denmark,56.263920,9.501785,5.9,Fotorama
3,tt0002101,Cleopatra,1912,100,$ 45000,None,None,USA,37.090240,-95.712891,5.2,Helen Gardner Picture Players
4,tt0002130,L'Inferno,1911,68,None,None,None,Italy,41.871940,12.567380,7.0,Milano Film
...,...,...,...,...,...,...,...,...,...,...,...,...
102884,tt9903716,Jessie,2019,106,None,None,None,India,20.593684,78.962880,7.2,Ekaa Art Production
102885,tt9905412,Ottam,2019,120,INR 4000000,None,$ 4791,India,20.593684,78.962880,7.8,Thomas Thiruvalla Films
102886,tt9905462,Pengalila,2019,111,INR 10000000,None,None,India,20.593684,78.962880,8.4,Benzy Productions
102887,tt9911774,Padmavyuhathile Abhimanyu,2019,130,None,None,None,India,20.593684,78.962880,8.4,RMCC Productions
102888,tt9914286,Sokagin Çocuklari,2019,98,None,None,$ 2833,Turkey,38.963745,35.243322,7.2,Gizem Ajans

In [64]:
# Merge current_movie_info_df and mov_gen_merge_df DataFrames
# Merge the two data sets along movie_id
movie_info_df = pd.merge(current_movie_info_df, mov_gen_merge_df, how="left", on=["movie_id", "movie_id"], suffixes=('_a', '_b'))
movie_info_df #.head()

,movie_id,movie_title,year_published,movie_duration,budget,usa_gross_income,worlwide_gross_income,country_name,lat,long,votes_avg,company_name,genre_id,genre_name
0,tt0000574,The Story of the Kelly Gang,1906,70,$ 2250,None,None,Australia,-25.274398,133.775136,6.1,J. and N. Tait,0,Biography
1,tt0000574,The Story of the Kelly Gang,1906,70,$ 2250,None,None,Australia,-25.274398,133.775136,6.1,J. and N. Tait,1,Crime
2,tt0000574,The Story of the Kelly Gang,1906,70,$ 2250,None,None,Australia,-25.274398,133.775136,6.1,J. and N. Tait,2,Drama
3,tt0001892,Den sorte drøm,1911,53,None,None,None,Germany,51.165691,10.451526,5.9,Fotorama,2,Drama
4,tt0001892,Den sorte drøm,1911,53,None,None,None,Denmark,56.263920,9.501785,5.9,Fotorama,2,Drama
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
212720,tt9905412,Ottam,2019,120,INR 4000000,None,$ 4791,India,20.593684,78.962880,7.8,Thomas Thiruvalla Films,2,Drama
212721,tt9905462,Pengalila,2019,111,INR 10000000,None,None,India,20.593684,78.962880,8.4,Benzy Productions,2,Drama
212722,tt9911774,Padmavyuhathile Abhimanyu,2019,130,None,None,None,India,20.593684,78.962880,8.4,RMCC Productions,2,Drama
212723,tt9914286,Sokagin Çocuklari,2019,98,None,None,$ 2833,Turkey,38.963745,35.243322,7.2,Gizem Ajans,2,Drama
212724,tt9914286,Sokagin Çocuklari,2019,98,None,None,$ 2833,Turkey,38.963745,35.243322,7.2,Gizem Ajans,12,Family

In [35]:
# Use a PostgreSQL query to get content of the movie table
movie_genre_junction_query = '''
SELECT * FROM public.movie_genre_junction
'''
# Create DataFrame from PostgreSQL query result.
movie_genre_junction_df = query_to_dataframe(movie_genre_junction_query)
# Display the DataFrame of the query results.
movie_genre_junction_df.head()

    movie_id genre_id
0  tt0000574        0
1  tt0000574        1
2  tt0000574        2
3  tt0001892        2
4  tt0002101        2

In [ ]:
connection.close()